// 주석을 달면 됨
/**
 * 주석이됨
 * 다음줄로 자동으로 넘어감
 */

/** 변수 규칙!
 * 라틴문자(0-9, a-z, A-Z), _
 * 대소문자를 구분함
 * 추천: camelCase (likeThis) ✅
 * 한국어 ❌
 * 예약어 ❌
 * 숫자로 시작 ❌
 * 특수문자 ❌ (_, $ 두가지는 예외)
 * 이모지 ❌
 * 여러개의 변수를 1, 2, 3 숫자로 구분 ❌ -> 최대한 의미있게, 구체적인 이름으로 작성!
 */

let apple;
let redApple;

// 나쁜예제 💩
let num = 20; //숫자 num 은 의미가 없어서 나쁜 예제

// 좋은예제 🌟
let myAge = 20; //변수 이름을 좀더 의미있게 작성하면 좋다.

// 나쁜예제 💩
let audio1;
let audio2;

// 좋은예제 🌟
let backgroundAudio;
let windAudio;

// 꿀팁 🍯
let audioBackground;
let audioWind;

audioBackground;
